## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.az_k8s.azurerm_kubernetes_cluster.k8s will be created
  + resource "azurerm_kubernetes_cluster" "k8s" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = (known after apply)
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "southeastasia"
      + name                                = (known after apply)
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "dop_rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "agentpool"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + linux_profile {
          + admin_username = "azureadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC+yYBx4eSoGISXFQMNUVML5WkoTBAJ/eHzV8H8XNWZa1o7Uh/dPYeqryRGdAETynWrsW4xgrmOJYx8fkindvZ3+UvkVCbnNzSIthkcgrC2Yw9/VaEpYCNWkVSb4mFz7a43+8DxWvdsmCr7tEhYr0dV/QsPpO2LUW3hX477iVG4tHv7ssgnM8IsCJkqhoUZL1ygatnO/NZzHON+lUj1WsWQWic2ErccB6KZZpvAnHmTF+ABgdtcOChXj6QizruXKfJlc/YSFelq7Cwx+fBVtH7cwINpOU1jquwibt6PZMqSkXkfQh1WRop92fhuorhs+Hns0SUX0NxeZsaeyoUBOJ31cflpk96kNnsyOvzp5iU8g/Mtck85OLfW1brGm1c8PkPUvOosTstCf26QS3/lDof7qxzVpq+yq4xha7fkn+9RO+kg3FynAgU1Y8WjnfA8t7pZxic94i37rP5AaYg6uawta7dngpNZHOmG0AP9pGH1gbgIOd2ihdBFHiG0VsOLBZ0= generated-by-azure"
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.az_k8s.random_pet.azurerm_kubernetes_cluster_dns_prefix will be created
  + resource "random_pet" "azurerm_kubernetes_cluster_dns_prefix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "dns"
      + separator = "-"
    }

  # module.az_k8s.random_pet.azurerm_kubernetes_cluster_name will be created
  + resource "random_pet" "azurerm_kubernetes_cluster_name" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "cluster"
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + client_certificate      = (sensitive value)
  + client_key              = (sensitive value)
  + cluster_ca_certificate  = (sensitive value)
  + cluster_password        = (sensitive value)
  + cluster_username        = (sensitive value)
  + host                    = (sensitive value)
  + kube_config             = (sensitive value)
  + kubernetes_cluster_name = (known after apply)
```
</details>